crypto-tracker/crypto-tracker-backend/app/controllers/coins_controller.rb

    def index
        coins = Coin.all
---
SELECT "coins".* FROM "coins"

    def create
        coin = Coin.create(
            name: params[:name],
            ticker_symbol: params[:tickerSymbol],
            ticker_image: params[:tickerImage],
            landing_page: params[:landingPage],
            status: params[:status],
            color: params[:color],
            balance: params[:balance]
        )
---
INSERT INTO "coins" ("name", "ticker_symbol", "ticker_image", "landing_page", "status", "color", "balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def destroy
        coin = Coin.find(params[:id])
        coin.destroy
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "coins" WHERE "coins"."id" = $1  [["id", 24]]

    def update
        coin = Coin.find(params[:id])
        updated_params = {params.keys.first => params[params.keys.first]}
        if coin.update(updated_params)
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
UPDATE "coins" SET "status" = $1, "updated_at" = $2 WHERE "coins"."id" = $3  [["status", "speculating"], ["updated_at", "2020-07-09 21:30:18.016484"], ["id", 57]]